Tranthan22/DesktopAssistant/MainECU_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Touch_IRQ_Pin GPIO_PIN_3
#define Touch_IRQ_GPIO_Port GPIOA
#define Touch_CS_Pin GPIO_PIN_4
#define Touch_CS_GPIO_Port GPIOA
#define Screen_CS_Pin GPIO_PIN_0
#define Screen_CS_GPIO_Port GPIOB
#define Screen_RST_Pin GPIO_PIN_1
#define Screen_RST_GPIO_Port GPIOB
#define Screen_DC_Pin GPIO_PIN_2
#define Screen_DC_GPIO_Port GPIOB
#define Screen_Led_Pin GPIO_PIN_10
#define Screen_Led_GPIO_Port GPIOB
#define ESP_CS_Pin GPIO_PIN_12
#define ESP_CS_GPIO_Port GPIOB
#define SDCard_CS_Pin GPIO_PIN_8
#define SDCard_CS_GPIO_Port GPIOA
#define ESP_SCL_Pin GPIO_PIN_6
#define ESP_SCL_GPIO_Port GPIOB
#define ESP_SDA_Pin GPIO_PIN_7
#define ESP_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
